<a href="https://colab.research.google.com/github/shruthi-jay/pandas/blob/main/pytho.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

                                                     CREATING DATAFRAME USING DIFFERENT METHODS

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.There are many ways of creating a dataframe. Few ways to create a dataframe are :

1.Create an empty DataFrame
    
       a) without any column name or indices and then appending columns one by one to it.

In [5]:
# importing the pandas library  
import pandas as pd  
df = pd.DataFrame()  
print (df)  
df['Pokemon'] = ['Charmander', 'Pikachu', 'Squirtle']
df['Type'] = ['Fire','Electric','Water']
df['Hp'] = [58, 35, 44]
df

Empty DataFrame
Columns: []
Index: []

      Pokemon      Type  Hp
0  Charmander      Fire  58
1     Pikachu  Electric  35
2    Squirtle     Water  44

        b) with columns name only then appending rows one by one to it using append() method.

In [13]:
import pandas as pd
# create an Empty DataFrame object With column names only
df = pd.DataFrame(columns = ['Nam', 'Type', 'Total'])
print(df)
# append rows to an empty DataFrame
df = df.append({'Nam':'Bulbasaur','Type':'Grass','Total':318},ignore_index = True)
df = df.append({'Nam':'Ivysaur','Type':'Grass','Total':405},ignore_index = True)
df = df.append({'Nam':' Venusaur','Type':'Grass','Total':525},ignore_index = True)
df

Empty DataFrame
Columns: [Nam, Type, Total]
Index: []

         Nam   Type Total
0  Bulbasaur  Grass   318
1    Ivysaur  Grass   405
2   Venusaur  Grass   525

      c) with a column name and indices and then appending rows one by one to it using loc[] method

In [20]:
import pandas as pd
# create an Empty DataFrame object With column names and indices 
df = pd.DataFrame(columns = ['Hero', 'Agility', 'Accelerated Healing'], index = ['a', 'b', 'c'])
print("Empty DataFrame\n", df)
# adding rows to an empty  dataframe at existing index
df.loc['a'] = [' 3-D Man','True','False']
df.loc['b'] = ['A-Bomb','False','True']
df.loc['c'] = ['Abe Sapien','True','True']
df

Empty DataFrame
   Hero Agility Accelerated Healing
a  NaN     NaN                 NaN
b  NaN     NaN                 NaN
c  NaN     NaN                 NaN

         Hero Agility Accelerated Healing
a     3-D Man    True               False
b      A-Bomb   False                True
c  Abe Sapien    True                True

2) Create DataFrame using List

    a) with index and column names

In [36]:
import pandas as pd
# list of strings
lst = ['Snow White and the Seven Dwarfs','Pinocchio','Fantasia']
# Calling DataFrame constructor on list  with indices and columns specified
df = pd.DataFrame(lst, index =['1937-12-21', '1940-02-09',' 1940-11-13'],columns =['Movie'])
df

                                       Movie
1937-12-21   Snow White and the Seven Dwarfs
1940-02-09                         Pinocchio
 1940-11-13                         Fantasia

    b) Creating DataFrame using multi-dimensional list

In [37]:
import pandas as pd 
lst = [['The Light Between Oceans','Drama'], ['Queen of Katwe','Drama'],
       ['Doctor Strange','Adventure'], ['Moana','Adventure']]
    
df = pd.DataFrame(lst, columns =['Movie', 'Type'])
df

                      Movie       Type
0  The Light Between Oceans      Drama
1            Queen of Katwe      Drama
2            Doctor Strange  Adventure
3                     Moana  Adventure

3)Create Dataframe from Numpy Array

In [38]:
import pandas as pd
import numpy as np
# creating the Numpy array
array = np.array([['Earth','Documentary'], ['Up','Adventure'],
                  ['The Proposal','Romantic Comedy'], ['Toy Story 3D Double Feature','Adventure'], 
                  ['The Princess and the Frog','Adventure']])
# creating a list of index names
index_values = ['A', 'B', 'C', 'D', 'E']
# creating a list of column names
column_values = ['Movie', 'Age']
# creating the dataframe
df = pd.DataFrame(data = array, 
                  index = index_values, 
                  columns = column_values)
# displaying the dataframe
print(df)

                         Movie              Age
A                        Earth      Documentary
B                           Up        Adventure
C                 The Proposal  Romantic Comedy
D  Toy Story 3D Double Feature        Adventure
E    The Princess and the Frog        Adventure

4)Create data frame using dictionary

    a) using default Constructor of pandas-Dataframe class

In [39]:
# import pandas library
import pandas as pd
# dictionary with list object in values
details = {
    'Title' : ['Fullmetal Alchemist: Brotherhood', 'your name', 'A Silent Voice'],
    'Format' : ['Tv','Movie','Movie'],
    'Episode' : [64,1,1],
}
# creating a Dataframe object 
df = pd.DataFrame(details,index = ['a', 'b', 'c'])
df

                              Title Format  Episode
a  Fullmetal Alchemist: Brotherhood     Tv       64
b                         your name  Movie        1
c                    A Silent Voice  Movie        1

  b) from Dictionary with required columns only

In [40]:
import pandas as pd
# dictionary with list object in values
details = {
    'Title' : ['Fullmetal Alchemist: Brotherhood', 'your name', 'A Silent Voice'],
    'Format' : ['Tv','Movie','Movie'],
    'Episode' : [64,1,1],
}
# creating a Dataframe object 
df = pd.DataFrame(details,index = ['a', 'b', 'c'],columns = ['Title', 'Format'])
df

                              Title Format
a  Fullmetal Alchemist: Brotherhood     Tv
b                         your name  Movie
c                    A Silent Voice  Movie

     c) from dictionary with key and simple value

In [41]:
import pandas as pd
# dictionary
details = {
    'Inception' : 2010,
    'Avengers: Infinity War' : 2018,
    'Back to the Future' : 1985,
    'Spider-Man: Into the Spider-Verse' :2018
    }
#creating a Dataframe object from a list of tuples of key, value pair
df = pd.DataFrame(list(details.items()))  
df

                                   0     1
0                          Inception  2010
1             Avengers: Infinity War  2018
2                 Back to the Future  1985
3  Spider-Man: Into the Spider-Verse  2018

    d) from nested Dictionary.

In [42]:
import pandas as pd
# dictionary with dictionary object in values i.e. nested dictionary
details = { 
    0 : {
        'Title' :'Like Stars on Earth',
        'Year' : 2007,
        'IMDb rating' :8.4
        },
    1 : {
       'Title' :'A Silent Voice',
        'Year' :2016,
        'IMDb rating' :8.2
        },
    2 : {
         'Title' :'Bill Burr: Im Sorry You Feel That Way',
        'Year' :2014 ,
        'IMDb rating' :8.4
        },
    3:  {
        'Title':'The Pianist'   ,
         'Year' :2002   ,
         'IMDb rating' : 8.5
        },
    4:  {
        'Title':'Austin Powers: International Man of Mystery'    ,
         'Year' : 1997   ,
         'IMDb rating' : 7
        },
    5:  {
        'Title':'Paper Tiger',
         'Year' :2019,
         'IMDb rating' : 8.2
         },
    6:  {
        'Title':'Avengers: Infinity War',
         'Year' : 2018   ,
         'IMDb rating' : 8.5
    },
}
  
# creating a Dataframe object from nested dictionaryin which inside dictionary key is act as index valueand column value is 0, 1, 2...
df = pd.DataFrame(details)
# swap the columns with indexes
df = df.transpose()
df

                                         Title  Year IMDb rating
0                          Like Stars on Earth  2007         8.4
1                               A Silent Voice  2016         8.2
2        Bill Burr: Im Sorry You Feel That Way  2014         8.4
3                                  The Pianist  2002         8.5
4  Austin Powers: International Man of Mystery  1997           7
5                       Bill Burr: Paper Tiger  2019         8.2
6                       Avengers: Infinity War  2018         8.5

5)  copying an existing dataframe

In [33]:
df1 = df.head(3).copy()
df1

                                   Title  Year IMDb rating
0                    Like Stars on Earth  2007         8.4
1                         A Silent Voice  2016         8.2
2  Bill Burr: Im Sorry You Feel That Way  2014         8.4